[Killed] BlockStatement
index.js:4:50
 //Testare functionala, structurala si cu mutatii
 
 // Gaseste un caracter intr un sir dat de lungime n
-const findChar = (n, bigString, charToSearch) => {
-  if (
-    n < 1 ||
-    n > 20 ||
-    String(bigString).length !== n ||
-    typeof n !== "number"
-  )
-    return null;
-
-  const pos = String(bigString).indexOf(charToSearch);
-
-  if (pos === -1) {
-    return "Character not found.";
-  } else {
-    return pos;
-  }
-};
+const findChar = (n, bigString, charToSearch) => {};
 
 // Calculeaza suma numerelor pare si suma cifrelor numerelor impare dintr-un array dat
killedBy: Functional Testing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: undefined

[Killed] LogicalOperator
index.js:6:5
 // Gaseste un caracter intr un sir dat de lungime n
 const findChar = (n, bigString, charToSearch) => {
   if (
-    n < 1 ||
-    n > 20 ||
-    String(bigString).length !== n ||
-    typeof n !== "number"
+    (n < 1 || n > 20 || String(bigString).length !== n) && typeof n !== "number"
   )
     return null;
killedBy: Functional Testing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "Character not found."

[Killed] LogicalOperator
index.js:6:5
 // Gaseste un caracter intr un sir dat de lungime n
 const findChar = (n, bigString, charToSearch) => {
   if (
-    n < 1 ||
-    n > 20 ||
+    n < 1 && n > 20 ||
     String(bigString).length !== n ||
     typeof n !== "number"
killedBy: Functional Testing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: 157

[Killed] EqualityOperator
index.js:7:5
 const findChar = (n, bigString, charToSearch) => {
   if (
     n < 1 ||
-    n > 20 ||
+    n >= 20 ||
     String(bigString).length !== n ||
     typeof n !== "number"
killedBy: Functional Testing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: null

[Killed] ConditionalExpression
index.js:7:5
 const findChar = (n, bigString, charToSearch) => {
   if (
     n < 1 ||
-    n > 20 ||
+    false ||
     String(bigString).length !== n ||
     typeof n !== "number"
killedBy: Functional Testing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: 99

[Killed] EqualityOperator
index.js:8:5
   if (
     n < 1 ||
     n > 20 ||
-    String(bigString).length !== n ||
+    String(bigString).length === n ||
     typeof n !== "number"
   )
killedBy: Functional Testing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: null

[Survived] ConditionalExpression
index.js:8:5
   if (
     n < 1 ||
     n > 20 ||
-    String(bigString).length !== n ||
+    false ||
     typeof n !== "number"
   )

[Killed] EqualityOperator
index.js:9:5
     n < 1 ||
     n > 20 ||
     String(bigString).length !== n ||
-    typeof n !== "number"
+    typeof n === "number"
   )
     return null;
killedBy: Functional Testing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: null

[Survived] ConditionalExpression
index.js:9:5
     n < 1 ||
     n > 20 ||
     String(bigString).length !== n ||
-    typeof n !== "number"
+    false
   )
     return null;

[Killed] ConditionalExpression
index.js:15:7
 
   const pos = String(bigString).indexOf(charToSearch);
 
-  if (pos === -1) {
+  if (false) {
     return "Character not found.";
   } else {
killedBy: Functional Testing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Character not found."
Received: -1

[Killed] EqualityOperator
index.js:15:7
 
   const pos = String(bigString).indexOf(charToSearch);
 
-  if (pos === -1) {
+  if (pos !== -1) {
     return "Character not found.";
   } else {
killedBy: Functional Testing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: "Character not found."

[Killed] BlockStatement
index.js:23:38
 };
 
 // Calculeaza suma numerelor pare si suma cifrelor numerelor impare dintr-un array dat
-const computeSum = (numbersArray) => {
-  if (numbersArray.length === 0) {
-    return null;
-  }
-
-  let sumEven = 0,
-    sumOdd = 0;
-
-  for (let n of numbersArray) {
-    n = Math.floor(n); //lucram doar cu numere intregi
-    if (n % 2 == 0) {
-      sumEven += n;
-    } else {
-      while (n) {
-        sumOdd += n % 10;
-        n = Math.floor(n / 10);
-      }
-    }
-  }
-
-  return { sumEven, sumOdd };
-};
+const computeSum = (numbersArray) => {};
 
 computeSum([1, 2, 3, 4]);
killedBy: Structural Testing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: undefined

[Killed] BlockStatement
index.js:24:34
 
 // Calculeaza suma numerelor pare si suma cifrelor numerelor impare dintr-un array dat
 const computeSum = (numbersArray) => {
-  if (numbersArray.length === 0) {
-    return null;
-  }
+  if (numbersArray.length === 0) {}
 
   let sumEven = 0,
killedBy: Structural Testing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: {"sumEven": 0, "sumOdd": 0}

[Killed] BlockStatement
index.js:31:31
   let sumEven = 0,
     sumOdd = 0;
 
-  for (let n of numbersArray) {
-    n = Math.floor(n); //lucram doar cu numere intregi
-    if (n % 2 == 0) {
-      sumEven += n;
-    } else {
-      while (n) {
-        sumOdd += n % 10;
-        n = Math.floor(n / 10);
-      }
-    }
-  }
+  for (let n of numbersArray) {}
 
   return { sumEven, sumOdd };
killedBy: Structural Testing
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "sumEven": 20,
-   "sumOdd": 25,

[Killed] EqualityOperator
index.js:33:9
 
   for (let n of numbersArray) {
     n = Math.floor(n); //lucram doar cu numere intregi
-    if (n % 2 == 0) {
+    if (n % 2 != 0) {
       sumEven += n;
     } else {
killedBy: Structural Testing
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "sumEven": 20,
-   "sumOdd": 25,

[Killed] ConditionalExpression
index.js:33:9
 
   for (let n of numbersArray) {
     n = Math.floor(n); //lucram doar cu numere intregi
-    if (n % 2 == 0) {
+    if (true) {
       sumEven += n;
     } else {
killedBy: Structural Testing
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "sumEven": 20,
-   "sumOdd": 25,
