[Killed] BlockStatement
index.js:2:50
 // Find a character in a given string of lenght n
-const findChar = (n, bigString, charToSearch) => {
-  if (n < 1 || n > 20) return null;
-
-  const pos = String(bigString).indexOf(charToSearch);
-
-  if (pos === -1) {
-    return "Character not found.";
-  } else {
-    return pos;
-  }
-};
+const findChar = (n, bigString, charToSearch) => {};
 
 // Compute the sum of the even numbers and the sum of the digits of odd numbers
killedBy: Functional Testing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: undefined

[Killed] EqualityOperator
index.js:3:7
 // Find a character in a given string of lenght n
 const findChar = (n, bigString, charToSearch) => {
-  if (n < 1 || n > 20) return null;
+  if (n >= 1 || n > 20) return null;
 
   const pos = String(bigString).indexOf(charToSearch);
killedBy: Functional Testing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "Character not found."

[Killed] ConditionalExpression
index.js:3:7
 // Find a character in a given string of lenght n
 const findChar = (n, bigString, charToSearch) => {
-  if (n < 1 || n > 20) return null;
+  if (true) return null;
 
   const pos = String(bigString).indexOf(charToSearch);
killedBy: Functional Testing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 7
Received: null

[Killed] BlockStatement
index.js:7:19
 
   const pos = String(bigString).indexOf(charToSearch);
 
-  if (pos === -1) {
-    return "Character not found.";
-  } else {
+  if (pos === -1) {} else {
     return pos;
   }
killedBy: Functional Testing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Character not found."
Received: undefined

[Killed] ConditionalExpression
index.js:7:7
 
   const pos = String(bigString).indexOf(charToSearch);
 
-  if (pos === -1) {
+  if (true) {
     return "Character not found.";
   } else {
killedBy: Functional Testing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: "Character not found."

[Killed] BlockStatement
index.js:9:10
 
   if (pos === -1) {
     return "Character not found.";
-  } else {
-    return pos;
-  }
+  } else {}
 };
 
killedBy: Functional Testing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 13
Received: undefined

[Killed] BlockStatement
index.js:15:38
 };
 
 // Compute the sum of the even numbers and the sum of the digits of odd numbers
-const computeSum = (numbersArray) => {
-  if (numbersArray.length === 0) {
-    return null;
-  }
-
-  let sumEven = 0,
-    sumOdd = 0;
-
-  for (let n of numbersArray) {
-    n = Math.floor(n);
-    if (n % 2 == 0) {
-      sumEven += n;
-    } else {
-      while (n) {
-        sumOdd += n % 10;
-        n = Math.floor(n / 10);
-      }
-    }
-  }
-
-  return { sumEven, sumOdd };
-};
+const computeSum = (numbersArray) => {};
 
 module.exports = {
killedBy: Structural Testing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: undefined

[Killed] ConditionalExpression
index.js:16:7
 
 // Compute the sum of the even numbers and the sum of the digits of odd numbers
 const computeSum = (numbersArray) => {
-  if (numbersArray.length === 0) {
+  if (false) {
     return null;
   }
killedBy: Structural Testing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: {"sumEven": 0, "sumOdd": 0}

[Killed] ConditionalExpression
index.js:16:7
 
 // Compute the sum of the even numbers and the sum of the digits of odd numbers
 const computeSum = (numbersArray) => {
-  if (numbersArray.length === 0) {
+  if (true) {
     return null;
   }
killedBy: Structural Testing
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"sumEven": 20, "sumOdd": 25}
Received: null

[Killed] BlockStatement
index.js:23:31
   let sumEven = 0,
     sumOdd = 0;
 
-  for (let n of numbersArray) {
-    n = Math.floor(n);
-    if (n % 2 == 0) {
-      sumEven += n;
-    } else {
-      while (n) {
-        sumOdd += n % 10;
-        n = Math.floor(n / 10);
-      }
-    }
-  }
+  for (let n of numbersArray) {}
 
   return { sumEven, sumOdd };
killedBy: Structural Testing
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "sumEven": 20,
-   "sumOdd": 25,

[Killed] ConditionalExpression
index.js:25:9
 
   for (let n of numbersArray) {
     n = Math.floor(n);
-    if (n % 2 == 0) {
+    if (false) {
       sumEven += n;
     } else {
killedBy: Structural Testing
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "sumEven": 20,
-   "sumOdd": 25,

[Killed] ArithmeticOperator
index.js:25:9
 
   for (let n of numbersArray) {
     n = Math.floor(n);
-    if (n % 2 == 0) {
+    if (n * 2 == 0) {
       sumEven += n;
     } else {
killedBy: Structural Testing
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "sumEven": 20,
-   "sumOdd": 25,

[Killed] AssignmentOperator
index.js:26:7
   for (let n of numbersArray) {
     n = Math.floor(n);
     if (n % 2 == 0) {
-      sumEven += n;
+      sumEven -= n;
     } else {
       while (n) {
killedBy: Structural Testing
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "sumEven": 20,
+   "sumEven": -20,

[Killed] BlockStatement
index.js:27:12
     n = Math.floor(n);
     if (n % 2 == 0) {
       sumEven += n;
-    } else {
-      while (n) {
-        sumOdd += n % 10;
-        n = Math.floor(n / 10);
-      }
-    }
+    } else {}
   }
 
killedBy: Structural Testing
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "sumEven": 20,
-   "sumOdd": 25,

[Killed] ConditionalExpression
index.js:28:14
     if (n % 2 == 0) {
       sumEven += n;
     } else {
-      while (n) {
+      while (false) {
         sumOdd += n % 10;
         n = Math.floor(n / 10);
killedBy: Structural Testing
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "sumEven": 20,
-   "sumOdd": 25,

[Timeout] BlockStatement
index.js:28:17
     if (n % 2 == 0) {
       sumEven += n;
     } else {
-      while (n) {
-        sumOdd += n % 10;
-        n = Math.floor(n / 10);
-      }
+      while (n) {}
     }
   }

[Killed] AssignmentOperator
index.js:29:9
       sumEven += n;
     } else {
       while (n) {
-        sumOdd += n % 10;
+        sumOdd -= n % 10;
         n = Math.floor(n / 10);
       }
killedBy: Structural Testing
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "sumEven": 20,
-   "sumOdd": 25,

[Killed] ArithmeticOperator
index.js:29:19
       sumEven += n;
     } else {
       while (n) {
-        sumOdd += n % 10;
+        sumOdd += n * 10;
         n = Math.floor(n / 10);
       }
killedBy: Structural Testing
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "sumEven": 20,
-   "sumOdd": 25,

[Timeout] ArithmeticOperator
index.js:30:24
     } else {
       while (n) {
         sumOdd += n % 10;
-        n = Math.floor(n / 10);
+        n = Math.floor(n * 10);
       }
     }
